; ModuleID = 'ssl.bc'
source_filename = "../../../src/openvpn/ssl.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.tls_cipher_name_pair = type { i8*, i8* }
%struct.user_pass = type { i8, i8, i8, i8, [128 x i8], [128 x i8] }
%struct.management = type { %struct.man_persist, %struct.man_settings, %struct.man_connection }
%struct.man_persist = type { i8, %struct.log_history*, %struct.virtual_output, i8, %struct.management_callback, %struct.log_history*, %struct.log_history*, i8, i8*, i64, i64 }
%struct.virtual_output = type { i8*, i32, void (i8*, i32, i8*)* }
%struct.management_callback = type { i8*, i32, void (i8*, i32, %struct.status_output*)*, void (i8*, i32)*, i32 (i8*, i8*)*, i32 (i8*, i32, i32)*, void (i8*, i32)*, i32 (i8*)*, i1 (i8*, i64, i8*)*, i1 (i8*, i64, i32, i1, i8*, i8*, %struct.buffer_list*)*, i8* (i8*, i64)*, i1 (i8*, i64, %struct.buffer_list*)*, i1 (i8*, i8**)*, i1 (i8*, i8**)* }
%struct.status_output = type { i32, i8*, i32, i32, %struct.virtual_output*, %struct.buffer, %struct.event_timeout, i8 }
%struct.buffer = type { i32, i32, i32, i8* }
%struct.event_timeout = type { i8, i32, i64 }
%struct.buffer_list = type { %struct.buffer_entry*, %struct.buffer_entry*, i32, i32 }
%struct.buffer_entry = type { %struct.buffer, %struct.buffer_entry* }
%struct.log_history = type { i32, i32, i32, %struct.log_entry* }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "tls_cipher_name_translation_table", scope: !2, file: !3, line: 113, type: !729, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 5.0.0 (tags/RELEASE_500/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !134, globals: !720)
!3 = !DIFile(filename: "../../../src/openvpn/ssl.c", directory: "/home/kevin/Bugs/openvpn-2.4.6/build_opt/src/openvpn")
!4 = !{!5, !10, !120, !129}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 50, size: 32, elements: !7)
!6 = !DIFile(filename: "../../../src/openvpn/crypto_backend.h", directory: "/home/kevin/Bugs/openvpn-2.4.6/build_opt/src/openvpn")
!7 = !{!8, !9}
!8 = !DIEnumerator(name: "MD_SHA1", value: 0)
!9 = !DIEnumerator(name: "MD_SHA256", value: 1)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !12, file: !11, line: 209, size: 32, elements: !116)
!11 = !DIFile(filename: "../../../src/openvpn/ssl_common.h", directory: "/home/kevin/Bugs/openvpn-2.4.6/build_opt/src/openvpn")
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tls_wrap_ctx", file: !11, line: 207, size: 1728, elements: !13)
!13 = !{!14, !15, !107}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !12, file: !11, line: 213, baseType: !10, size: 32)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "opt", scope: !12, file: !11, line: 214, baseType: !16, size: 1472, offset: 64)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "crypto_options", file: !17, line: 235, size: 1472, elements: !18)
!17 = !DIFile(filename: "../../../src/openvpn/crypto.h", directory: "/home/kevin/Bugs/openvpn-2.4.6/build_opt/src/openvpn")
!18 = !{!19, !51, !96, !106}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "key_ctx_bi", scope: !16, file: !17, line: 237, baseType: !20, size: 704)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "key_ctx_bi", file: !17, line: 222, size: 704, elements: !21)
!21 = !{!22, !48, !49}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "encrypt", scope: !20, file: !17, line: 224, baseType: !23, size: 320)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "key_ctx", file: !17, line: 167, size: 320, elements: !24)
!24 = !{!25, !32, !37, !44}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "cipher", scope: !23, file: !17, line: 169, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "cipher_ctx_t", file: !28, line: 44, baseType: !29)
!28 = !DIFile(filename: "../../../src/openvpn/crypto_openssl.h", directory: "/home/kevin/Bugs/openvpn-2.4.6/build_opt/src/openvpn")
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_CIPHER_CTX", file: !30, line: 90, baseType: !31)
!30 = !DIFile(filename: "/usr/include/openssl/ossl_typ.h", directory: "/home/kevin/Bugs/openvpn-2.4.6/build_opt/src/openvpn")
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_cipher_ctx_st", file: !30, line: 90, flags: DIFlagFwdDecl)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "hmac", scope: !23, file: !17, line: 170, baseType: !33, size: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "hmac_ctx_t", file: !28, line: 50, baseType: !35)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "HMAC_CTX", file: !30, line: 102, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "hmac_ctx_st", file: !30, line: 102, flags: DIFlagFwdDecl)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_iv", scope: !23, file: !17, line: 171, baseType: !38, size: 128, offset: 128)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 128, elements: !42)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !40, line: 48, baseType: !41)
!40 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/kevin/Bugs/openvpn-2.4.6/build_opt/src/openvpn")
!41 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!42 = !{!43}
!43 = !DISubrange(count: 16)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_iv_len", scope: !23, file: !17, line: 173, baseType: !45, size: 64, offset: 256)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !46, line: 62, baseType: !47)
!46 = !DIFile(filename: "/home/kevin/Tools/llvm5.0/install/lib/clang/5.0.0/include/stddef.h", directory: "/home/kevin/Bugs/openvpn-2.4.6/build_opt/src/openvpn")
!47 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "decrypt", scope: !20, file: !17, line: 226, baseType: !23, size: 320, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !20, file: !17, line: 228, baseType: !50, size: 8, offset: 640)
!50 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "packet_id", scope: !16, file: !17, line: 241, baseType: !52, size: 640, offset: 704)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "packet_id", file: !53, line: 207, size: 640, elements: !54)
!53 = !DIFile(filename: "../../../src/openvpn/packet_id.h", directory: "/home/kevin/Bugs/openvpn-2.4.6/build_opt/src/openvpn")
!54 = !{!55, !68}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !52, file: !53, line: 209, baseType: !56, size: 128)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "packet_id_send", file: !53, line: 172, size: 128, elements: !57)
!57 = !{!58, !62}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !56, file: !53, line: 174, baseType: !59, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "packet_id_type", file: !53, line: 51, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !40, line: 51, baseType: !61)
!61 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !56, file: !53, line: 175, baseType: !63, size: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !64, line: 75, baseType: !65)
!64 = !DIFile(filename: "/usr/include/time.h", directory: "/home/kevin/Bugs/openvpn-2.4.6/build_opt/src/openvpn")
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !66, line: 139, baseType: !67)
!66 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/kevin/Bugs/openvpn-2.4.6/build_opt/src/openvpn")
!67 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "rec", scope: !52, file: !53, line: 210, baseType: !69, size: 512, offset: 128)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "packet_id_rec", file: !53, line: 134, size: 512, elements: !70)
!70 = !{!71, !72, !73, !74, !76, !77, !78, !79, !91, !95}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "last_reap", scope: !69, file: !53, line: 136, baseType: !63, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !69, file: !53, line: 137, baseType: !63, size: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !69, file: !53, line: 138, baseType: !59, size: 32, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "seq_backtrack", scope: !69, file: !53, line: 139, baseType: !75, size: 32, offset: 160)
!75 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "time_backtrack", scope: !69, file: !53, line: 140, baseType: !75, size: 32, offset: 192)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "max_backtrack_stat", scope: !69, file: !53, line: 141, baseType: !75, size: 32, offset: 224)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !69, file: !53, line: 142, baseType: !50, size: 8, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "seq_list", scope: !69, file: !53, line: 143, baseType: !80, size: 64, offset: 320)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seq_list", file: !53, line: 127, size: 128, elements: !82)
!82 = !{!83, !84, !85, !86, !87}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "x_head", scope: !81, file: !53, line: 127, baseType: !75, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "x_size", scope: !81, file: !53, line: 127, baseType: !75, size: 32, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "x_cap", scope: !81, file: !53, line: 127, baseType: !75, size: 32, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "x_sizeof", scope: !81, file: !53, line: 127, baseType: !75, size: 32, offset: 96)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "x_list", scope: !81, file: !53, line: 127, baseType: !88, offset: 128)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 0)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !69, file: !53, line: 144, baseType: !92, size: 64, offset: 384)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!94 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !69, file: !53, line: 145, baseType: !75, size: 32, offset: 448)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "pid_persist", scope: !16, file: !17, line: 243, baseType: !97, size: 64, offset: 1344)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "packet_id_persist", file: !53, line: 152, size: 384, elements: !99)
!99 = !{!100, !101, !102, !103, !104, !105}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !98, file: !53, line: 154, baseType: !92, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !98, file: !53, line: 155, baseType: !75, size: 32, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !98, file: !53, line: 156, baseType: !63, size: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !98, file: !53, line: 157, baseType: !59, size: 32, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "time_last_written", scope: !98, file: !53, line: 158, baseType: !63, size: 64, offset: 256)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "id_last_written", scope: !98, file: !53, line: 159, baseType: !59, size: 32, offset: 320)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !16, file: !17, line: 264, baseType: !61, size: 32, offset: 1408)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !12, file: !11, line: 215, baseType: !108, size: 192, offset: 1536)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buffer", file: !109, line: 60, size: 192, elements: !110)
!109 = !DIFile(filename: "../../../src/openvpn/buffer.h", directory: "/home/kevin/Bugs/openvpn-2.4.6/build_opt/src/openvpn")
!110 = !{!111, !112, !113, !114}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !108, file: !109, line: 62, baseType: !75, size: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !108, file: !109, line: 64, baseType: !75, size: 32, offset: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !108, file: !109, line: 66, baseType: !75, size: 32, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !108, file: !109, line: 68, baseType: !115, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!116 = !{!117, !118, !119}
!117 = !DIEnumerator(name: "TLS_WRAP_NONE", value: 0)
!118 = !DIEnumerator(name: "TLS_WRAP_AUTH", value: 1)
!119 = !DIEnumerator(name: "TLS_WRAP_CRYPT", value: 2)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !121, line: 231, size: 32, elements: !122)
!121 = !DIFile(filename: "../../include/openvpn-plugin.h", directory: "/home/kevin/Bugs/openvpn-2.4.6/build_opt/src/openvpn")
!122 = !{!123, !124, !125, !126, !127, !128}
!123 = !DIEnumerator(name: "PLOG_ERR", value: 1)
!124 = !DIEnumerator(name: "PLOG_WARN", value: 2)
!125 = !DIEnumerator(name: "PLOG_NOTE", value: 4)
!126 = !DIEnumerator(name: "PLOG_DEBUG", value: 8)
!127 = !DIEnumerator(name: "PLOG_ERRNO", value: 256)
!128 = !DIEnumerator(name: "PLOG_NOMUTE", value: 512)
!129 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !121, line: 303, size: 32, elements: !130)
!130 = !{!131, !132, !133}
!131 = !DIEnumerator(name: "SSLAPI_NONE", value: 0)
!132 = !DIEnumerator(name: "SSLAPI_OPENSSL", value: 1)
!133 = !DIEnumerator(name: "SSLAPI_MBEDTLS", value: 2)
!134 = !{!135, !45, !136, !138, !92, !140, !697, !75, !703, !574, !594, !615, !115, !704, !706, !707, !60, !39, !517, !529, !209, !708}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tls_multi", file: !11, line: 478, size: 38400, elements: !142)
!142 = !{!143, !468, !648, !649, !650, !651, !652, !653, !654, !655, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "opt", scope: !141, file: !11, line: 484, baseType: !144, size: 5632)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tls_options", file: !11, line: 222, size: 5632, elements: !145)
!145 = !{!146, !159, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !204, !205, !206, !208, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !231, !232, !233, !234, !235, !236, !237, !238, !268, !431, !437, !438, !447, !457, !464, !465, !466, !467}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_ctx", scope: !144, file: !11, line: 225, baseType: !147, size: 192)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tls_root_ctx", file: !148, line: 49, size: 192, elements: !149)
!148 = !DIFile(filename: "../../../src/openvpn/ssl_openssl.h", directory: "/home/kevin/Bugs/openvpn-2.4.6/build_opt/src/openvpn")
!149 = !{!150, !154, !155}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !147, file: !148, line: 50, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_CTX", file: !30, line: 145, baseType: !153)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_ctx_st", file: !30, line: 145, flags: DIFlagFwdDecl)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "crl_last_mtime", scope: !147, file: !148, line: 51, baseType: !63, size: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "crl_last_size", scope: !147, file: !148, line: 52, baseType: !156, size: 64, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !157, line: 86, baseType: !158)
!157 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/kevin/Bugs/openvpn-2.4.6/build_opt/src/openvpn")
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !66, line: 131, baseType: !67)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "key_type", scope: !144, file: !11, line: 228, baseType: !160, size: 192, offset: 192)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "key_type", file: !17, line: 142, size: 192, elements: !161)
!161 = !{!162, !163, !164, !170}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_length", scope: !160, file: !17, line: 144, baseType: !39, size: 8)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "hmac_length", scope: !160, file: !17, line: 145, baseType: !39, size: 8, offset: 8)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "cipher", scope: !160, file: !17, line: 146, baseType: !165, size: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "cipher_kt_t", file: !28, line: 38, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_CIPHER", file: !30, line: 89, baseType: !169)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_cipher_st", file: !30, line: 89, flags: DIFlagFwdDecl)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !160, file: !17, line: 147, baseType: !171, size: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "md_kt_t", file: !28, line: 41, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_MD", file: !30, line: 91, baseType: !175)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_md_st", file: !30, line: 91, flags: DIFlagFwdDecl)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !144, file: !11, line: 231, baseType: !50, size: 8, offset: 384)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "xmit_hold", scope: !144, file: !11, line: 234, baseType: !50, size: 8, offset: 392)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "local_options", scope: !144, file: !11, line: 239, baseType: !92, size: 64, offset: 448)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "remote_options", scope: !144, file: !11, line: 240, baseType: !92, size: 64, offset: 512)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "key_method", scope: !144, file: !11, line: 244, baseType: !75, size: 32, offset: 576)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "replay", scope: !144, file: !11, line: 245, baseType: !50, size: 8, offset: 608)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "single_session", scope: !144, file: !11, line: 246, baseType: !50, size: 8, offset: 616)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "disable_occ", scope: !144, file: !11, line: 248, baseType: !50, size: 8, offset: 624)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !144, file: !11, line: 250, baseType: !75, size: 32, offset: 640)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "pull", scope: !144, file: !11, line: 251, baseType: !50, size: 8, offset: 672)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "push_peer_info_detail", scope: !144, file: !11, line: 253, baseType: !75, size: 32, offset: 704)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "transition_window", scope: !144, file: !11, line: 255, baseType: !75, size: 32, offset: 736)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_window", scope: !144, file: !11, line: 256, baseType: !75, size: 32, offset: 768)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "packet_timeout", scope: !144, file: !11, line: 257, baseType: !190, size: 32, offset: 800)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "interval_t", file: !191, line: 45, baseType: !75)
!191 = !DIFile(filename: "../../../src/openvpn/common.h", directory: "/home/kevin/Bugs/openvpn-2.4.6/build_opt/src/openvpn")
!192 = !DIDerivedType(tag: DW_TAG_member, name: "renegotiate_bytes", scope: !144, file: !11, line: 258, baseType: !75, size: 32, offset: 832)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "renegotiate_packets", scope: !144, file: !11, line: 259, baseType: !75, size: 32, offset: 864)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "renegotiate_seconds", scope: !144, file: !11, line: 260, baseType: !190, size: 32, offset: 896)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "verify_command", scope: !144, file: !11, line: 263, baseType: !92, size: 64, offset: 960)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "verify_export_cert", scope: !144, file: !11, line: 264, baseType: !92, size: 64, offset: 1024)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "verify_x509_type", scope: !144, file: !11, line: 265, baseType: !75, size: 32, offset: 1088)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "verify_x509_name", scope: !144, file: !11, line: 266, baseType: !92, size: 64, offset: 1152)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "crl_file", scope: !144, file: !11, line: 267, baseType: !92, size: 64, offset: 1216)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "crl_file_inline", scope: !144, file: !11, line: 268, baseType: !92, size: 64, offset: 1280)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ns_cert_type", scope: !144, file: !11, line: 269, baseType: !75, size: 32, offset: 1344)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "remote_cert_ku", scope: !144, file: !11, line: 270, baseType: !203, size: 512, offset: 1376)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 512, elements: !42)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "remote_cert_eku", scope: !144, file: !11, line: 271, baseType: !92, size: 64, offset: 1920)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "verify_hash", scope: !144, file: !11, line: 272, baseType: !115, size: 64, offset: 1984)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "verify_hash_algo", scope: !144, file: !11, line: 273, baseType: !207, size: 32, offset: 2048)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_algo_type", file: !6, line: 53, baseType: !5)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "x509_username_field", scope: !144, file: !11, line: 274, baseType: !209, size: 64, offset: 2112)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "pass_config_info", scope: !144, file: !11, line: 278, baseType: !50, size: 8, offset: 2176)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "crypto_flags", scope: !144, file: !11, line: 281, baseType: !61, size: 32, offset: 2208)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "replay_window", scope: !144, file: !11, line: 283, baseType: !75, size: 32, offset: 2240)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "replay_time", scope: !144, file: !11, line: 284, baseType: !75, size: 32, offset: 2272)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_mode", scope: !144, file: !11, line: 285, baseType: !50, size: 8, offset: 2304)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "config_ciphername", scope: !144, file: !11, line: 287, baseType: !92, size: 64, offset: 2368)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "config_authname", scope: !144, file: !11, line: 288, baseType: !92, size: 64, offset: 2432)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "ncp_enabled", scope: !144, file: !11, line: 289, baseType: !50, size: 8, offset: 2496)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "tls_wrap", scope: !144, file: !11, line: 292, baseType: !12, size: 1728, offset: 2560)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !144, file: !11, line: 295, baseType: !220, size: 256, offset: 4288)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame", file: !221, line: 93, size: 256, elements: !222)
!221 = !DIFile(filename: "../../../src/openvpn/mtu.h", directory: "/home/kevin/Bugs/openvpn-2.4.6/build_opt/src/openvpn")
!222 = !{!223, !224, !225, !226, !227, !228, !229, !230}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "link_mtu", scope: !220, file: !221, line: 94, baseType: !75, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "link_mtu_dynamic", scope: !220, file: !221, line: 97, baseType: !75, size: 32, offset: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "extra_frame", scope: !220, file: !221, line: 100, baseType: !75, size: 32, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "extra_buffer", scope: !220, file: !221, line: 107, baseType: !75, size: 32, offset: 96)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "extra_tun", scope: !220, file: !221, line: 117, baseType: !75, size: 32, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "extra_link", scope: !220, file: !221, line: 122, baseType: !75, size: 32, offset: 160)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "align_flags", scope: !220, file: !221, line: 133, baseType: !61, size: 32, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "align_adjust", scope: !220, file: !221, line: 134, baseType: !75, size: 32, offset: 224)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "auth_user_pass_verify_script", scope: !144, file: !11, line: 298, baseType: !92, size: 64, offset: 4544)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "auth_user_pass_verify_script_via_file", scope: !144, file: !11, line: 299, baseType: !50, size: 8, offset: 4608)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_dir", scope: !144, file: !11, line: 300, baseType: !92, size: 64, offset: 4672)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "auth_user_pass_file", scope: !144, file: !11, line: 301, baseType: !92, size: 64, offset: 4736)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "auth_token_generate", scope: !144, file: !11, line: 302, baseType: !50, size: 8, offset: 4800)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "auth_token_lifetime", scope: !144, file: !11, line: 304, baseType: !61, size: 32, offset: 4832)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "client_config_dir_exclusive", scope: !144, file: !11, line: 307, baseType: !92, size: 64, offset: 4864)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "es", scope: !144, file: !11, line: 310, baseType: !239, size: 64, offset: 4928)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "env_set", file: !241, line: 49, size: 128, elements: !242)
!241 = !DIFile(filename: "../../../src/openvpn/misc.h", directory: "/home/kevin/Bugs/openvpn-2.4.6/build_opt/src/openvpn")
!242 = !{!243, !262}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !240, file: !241, line: 50, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gc_arena", file: !109, line: 116, size: 128, elements: !246)
!246 = !{!247, !252}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !245, file: !109, line: 118, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gc_entry", file: !109, line: 87, size: 64, elements: !250)
!250 = !{!251}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !249, file: !109, line: 89, baseType: !248, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "list_special", scope: !245, file: !109, line: 120, baseType: !253, size: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gc_entry_special", file: !109, line: 98, size: 192, elements: !255)
!255 = !{!256, !257, !261}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !254, file: !109, line: 100, baseType: !253, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "free_fnc", scope: !254, file: !109, line: 101, baseType: !258, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{null, !135}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !254, file: !109, line: 102, baseType: !135, size: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !240, file: !241, line: 51, baseType: !263, size: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "env_item", file: !241, line: 44, size: 128, elements: !265)
!265 = !{!266, !267}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !264, file: !241, line: 45, baseType: !209, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !264, file: !241, line: 46, baseType: !263, size: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "plugins", scope: !144, file: !11, line: 311, baseType: !269, size: 64, offset: 4992)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !271)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "plugin_list", file: !272, line: 94, size: 1152, elements: !273)
!272 = !DIFile(filename: "../../../src/openvpn/plugin.h", directory: "/home/kevin/Bugs/openvpn-2.4.6/build_opt/src/openvpn")
!273 = !{!274, !279, !430}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "per_client", scope: !271, file: !272, line: 96, baseType: !275, size: 1024)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "plugin_per_client", file: !272, line: 83, size: 1024, elements: !276)
!276 = !{!277}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "per_client_context", scope: !275, file: !272, line: 85, baseType: !278, size: 1024)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 1024, elements: !42)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !271, file: !272, line: 97, baseType: !280, size: 64, offset: 1024)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "plugin_common", file: !272, line: 88, size: 17472, elements: !282)
!282 = !{!283, !284}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !281, file: !272, line: 90, baseType: !75, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "plugins", scope: !281, file: !272, line: 91, baseType: !285, size: 17408, offset: 64)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 17408, elements: !42)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "plugin", file: !272, line: 55, size: 1088, elements: !287)
!287 = !{!288, !289, !290, !291, !292, !293, !301, !313, !370, !375, !380, !405, !410, !412, !417, !422, !427, !429}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !286, file: !272, line: 56, baseType: !50, size: 8)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "so_pathname", scope: !286, file: !272, line: 57, baseType: !92, size: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "plugin_type_mask", scope: !286, file: !272, line: 58, baseType: !61, size: 32, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "requested_initialization_point", scope: !286, file: !272, line: 59, baseType: !75, size: 32, offset: 160)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !286, file: !272, line: 62, baseType: !135, size: 64, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "open1", scope: !286, file: !272, line: 67, baseType: !294, size: 64, offset: 256)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "openvpn_plugin_open_v1", file: !121, line: 835, baseType: !295)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!298, !299, !300, !300}
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "openvpn_plugin_handle_t", file: !121, line: 146, baseType: !135)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "open2", scope: !286, file: !272, line: 68, baseType: !302, size: 64, offset: 320)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "openvpn_plugin_open_v2", file: !121, line: 495, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DISubroutineType(types: !305)
!305 = !{!298, !299, !300, !300, !306}
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "openvpn_plugin_string_list", file: !121, line: 193, size: 192, elements: !309)
!309 = !{!310, !311, !312}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !308, file: !121, line: 195, baseType: !307, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !308, file: !121, line: 196, baseType: !209, size: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !308, file: !121, line: 197, baseType: !209, size: 64, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "open3", scope: !286, file: !272, line: 69, baseType: !314, size: 64, offset: 384)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "openvpn_plugin_open_v3", file: !121, line: 623, baseType: !315)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!75, !318, !319, !363}
!318 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !321)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "openvpn_plugin_args_open_in", file: !121, line: 330, size: 512, elements: !322)
!322 = !{!323, !324, !326, !327, !354, !357, !358, !360, !361}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "type_mask", scope: !321, file: !121, line: 332, baseType: !318, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !321, file: !121, line: 333, baseType: !325, size: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !300)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !321, file: !121, line: 334, baseType: !325, size: 64, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks", scope: !321, file: !121, line: 335, baseType: !328, size: 64, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "openvpn_plugin_callbacks", file: !121, line: 290, size: 192, elements: !330)
!330 = !{!331, !337, !349}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "plugin_log", scope: !329, file: !121, line: 292, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "plugin_log_t", file: !121, line: 254, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{null, !336, !92, !92, null}
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "openvpn_plugin_log_flags_t", file: !121, line: 241, baseType: !120)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "plugin_vlog", scope: !329, file: !121, line: 293, baseType: !338, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "plugin_vlog_t", file: !121, line: 258, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{null, !336, !92, !92, !342}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 876, size: 192, elements: !344)
!344 = !{!345, !346, !347, !348}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !343, file: !3, line: 876, baseType: !61, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !343, file: !3, line: 876, baseType: !61, size: 32, offset: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !343, file: !3, line: 876, baseType: !135, size: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !343, file: !3, line: 876, baseType: !135, size: 64, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "plugin_secure_memzero", scope: !329, file: !121, line: 294, baseType: !350, size: 64, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "plugin_secure_memzero_t", file: !121, line: 271, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{null, !135, !45}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_api", scope: !321, file: !121, line: 336, baseType: !355, size: 32, offset: 256)
!355 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "ovpnSSLAPI", file: !121, line: 307, baseType: !129)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ovpn_version", scope: !321, file: !121, line: 337, baseType: !92, size: 64, offset: 320)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ovpn_version_major", scope: !321, file: !121, line: 338, baseType: !359, size: 32, offset: 384)
!359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ovpn_version_minor", scope: !321, file: !121, line: 339, baseType: !359, size: 32, offset: 416)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ovpn_version_patch", scope: !321, file: !121, line: 340, baseType: !362, size: 64, offset: 448)
!362 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "openvpn_plugin_args_open_return", file: !121, line: 365, size: 192, elements: !365)
!365 = !{!366, !367, !369}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "type_mask", scope: !364, file: !121, line: 367, baseType: !75, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !364, file: !121, line: 368, baseType: !368, size: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "return_list", scope: !364, file: !121, line: 369, baseType: !306, size: 64, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "func1", scope: !286, file: !272, line: 70, baseType: !371, size: 64, offset: 448)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "openvpn_plugin_func_v1", file: !121, line: 840, baseType: !372)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!75, !298, !318, !300, !300}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "func2", scope: !286, file: !272, line: 71, baseType: !376, size: 64, offset: 512)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "openvpn_plugin_func_v2", file: !121, line: 591, baseType: !377)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{!75, !298, !318, !300, !300, !135, !306}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "func3", scope: !286, file: !272, line: 72, baseType: !381, size: 64, offset: 576)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "openvpn_plugin_func_v3", file: !121, line: 707, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!75, !318, !385, !401}
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !387)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "openvpn_plugin_args_func_in", file: !121, line: 400, size: 448, elements: !388)
!388 = !{!389, !390, !391, !392, !393, !394, !395}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !387, file: !121, line: 402, baseType: !318, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !387, file: !121, line: 403, baseType: !325, size: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !387, file: !121, line: 404, baseType: !325, size: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !387, file: !121, line: 405, baseType: !298, size: 64, offset: 192)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "per_client_context", scope: !387, file: !121, line: 406, baseType: !135, size: 64, offset: 256)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "current_cert_depth", scope: !387, file: !121, line: 408, baseType: !75, size: 32, offset: 320)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "current_cert", scope: !387, file: !121, line: 409, baseType: !396, size: 64, offset: 384)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "openvpn_x509_cert_t", file: !398, line: 37, baseType: !399)
!398 = !DIFile(filename: "../../../src/openvpn/ssl_verify_openssl.h", directory: "/home/kevin/Bugs/openvpn-2.4.6/build_opt/src/openvpn")
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !30, line: 119, baseType: !400)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !30, line: 119, flags: DIFlagFwdDecl)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "openvpn_plugin_args_func_return", file: !121, line: 428, size: 64, elements: !403)
!403 = !{!404}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "return_list", scope: !402, file: !121, line: 430, baseType: !306, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !286, file: !272, line: 73, baseType: !406, size: 64, offset: 640)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "openvpn_plugin_close_v1", file: !121, line: 724, baseType: !407)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{null, !298}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "abort", scope: !286, file: !272, line: 74, baseType: !411, size: 64, offset: 704)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "openvpn_plugin_abort_v1", file: !121, line: 741, baseType: !407)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "client_constructor", scope: !286, file: !272, line: 75, baseType: !413, size: 64, offset: 768)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "openvpn_plugin_client_constructor_v1", file: !121, line: 770, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!135, !298}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "client_destructor", scope: !286, file: !272, line: 76, baseType: !418, size: 64, offset: 832)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "openvpn_plugin_client_destructor_v1", file: !121, line: 788, baseType: !419)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{null, !298, !135}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "min_version_required", scope: !286, file: !272, line: 77, baseType: !423, size: 64, offset: 896)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "openvpn_plugin_min_version_required_v1", file: !121, line: 828, baseType: !424)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!75}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "initialization_point", scope: !286, file: !272, line: 78, baseType: !428, size: 64, offset: 960)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "openvpn_plugin_select_initialization_point_v1", file: !121, line: 812, baseType: !424)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "plugin_handle", scope: !286, file: !272, line: 80, baseType: !298, size: 64, offset: 1024)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "common_owned", scope: !271, file: !272, line: 98, baseType: !50, size: 8, offset: 1088)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "comp_options", scope: !144, file: !11, line: 315, baseType: !432, size: 64, offset: 5056)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "compress_options", file: !433, line: 133, size: 64, elements: !434)
!433 = !DIFile(filename: "../../../src/openvpn/comp.h", directory: "/home/kevin/Bugs/openvpn-2.4.6/build_opt/src/openvpn")
!434 = !{!435, !436}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "alg", scope: !432, file: !433, line: 135, baseType: !75, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !432, file: !433, line: 136, baseType: !61, size: 32, offset: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_flags", scope: !144, file: !11, line: 329, baseType: !61, size: 32, offset: 5120)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "mda_context", scope: !144, file: !11, line: 332, baseType: !439, size: 64, offset: 5184)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "man_def_auth_context", file: !441, line: 44, size: 192, elements: !442)
!441 = !DIFile(filename: "../../../src/openvpn/manage.h", directory: "/home/kevin/Bugs/openvpn-2.4.6/build_opt/src/openvpn")
!442 = !{!443, !444, !445, !446}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "cid", scope: !440, file: !441, line: 45, baseType: !47, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !440, file: !441, line: 50, baseType: !61, size: 32, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "mda_key_id_counter", scope: !440, file: !441, line: 52, baseType: !61, size: 32, offset: 96)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "bytecount_last_update", scope: !440, file: !441, line: 54, baseType: !63, size: 64, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "x509_track", scope: !144, file: !11, line: 335, baseType: !448, size: 64, offset: 5248)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x509_track", file: !451, line: 201, size: 192, elements: !452)
!451 = !DIFile(filename: "../../../src/openvpn/ssl_verify.h", directory: "/home/kevin/Bugs/openvpn-2.4.6/build_opt/src/openvpn")
!452 = !{!453, !454, !455, !456}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !450, file: !451, line: 203, baseType: !448, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !450, file: !451, line: 204, baseType: !92, size: 64, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !450, file: !451, line: 206, baseType: !61, size: 32, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "nid", scope: !450, file: !451, line: 207, baseType: !75, size: 32, offset: 160)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "sci", scope: !144, file: !11, line: 338, baseType: !458, size: 64, offset: 5312)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !460)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "static_challenge_info", file: !241, line: 208, size: 128, elements: !461)
!461 = !{!462, !463}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !460, file: !241, line: 210, baseType: !61, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "challenge_text", scope: !460, file: !241, line: 212, baseType: !92, size: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "gremlin", scope: !144, file: !11, line: 342, baseType: !75, size: 32, offset: 5376)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ekm_label", scope: !144, file: !11, line: 345, baseType: !92, size: 64, offset: 5440)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ekm_label_size", scope: !144, file: !11, line: 346, baseType: !45, size: 64, offset: 5504)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ekm_size", scope: !144, file: !11, line: 347, baseType: !45, size: 64, offset: 5568)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "key_scan", scope: !141, file: !11, line: 486, baseType: !469, size: 192, offset: 5632)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !470, size: 192, elements: !646)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "key_state", file: !11, line: 148, size: 3904, elements: !472)
!472 = !{!473, !474, !475, !488, !489, !490, !491, !492, !500, !572, !573, !590, !591, !592, !593, !613, !614, !621, !634, !637, !638, !639, !640, !641, !642, !643, !644, !645}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !471, file: !11, line: 150, baseType: !75, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "key_id", scope: !471, file: !11, line: 156, baseType: !75, size: 32, offset: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ks_ssl", scope: !471, file: !11, line: 158, baseType: !476, size: 256, offset: 64)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "key_state_ssl", file: !148, line: 55, size: 256, elements: !477)
!477 = !{!478, !482, !486, !487}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !476, file: !148, line: 56, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !30, line: 144, baseType: !481)
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !30, line: 144, flags: DIFlagFwdDecl)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_bio", scope: !476, file: !148, line: 57, baseType: !483, size: 64, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !30, line: 79, baseType: !485)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !30, line: 79, flags: DIFlagFwdDecl)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ct_in", scope: !476, file: !148, line: 58, baseType: !483, size: 64, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ct_out", scope: !476, file: !148, line: 59, baseType: !483, size: 64, offset: 192)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "established", scope: !471, file: !11, line: 160, baseType: !63, size: 64, offset: 320)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "must_negotiate", scope: !471, file: !11, line: 161, baseType: !63, size: 64, offset: 384)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "must_die", scope: !471, file: !11, line: 162, baseType: !63, size: 64, offset: 448)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "initial_opcode", scope: !471, file: !11, line: 164, baseType: !75, size: 32, offset: 512)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "session_id_remote", scope: !471, file: !11, line: 165, baseType: !493, size: 64, offset: 544)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "session_id", file: !494, line: 40, size: 64, elements: !495)
!494 = !DIFile(filename: "../../../src/openvpn/session_id.h", directory: "/home/kevin/Bugs/openvpn-2.4.6/build_opt/src/openvpn")
!495 = !{!496}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !493, file: !494, line: 42, baseType: !497, size: 64)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 64, elements: !498)
!498 = !{!499}
!499 = !DISubrange(count: 8)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "remote_addr", scope: !471, file: !11, line: 166, baseType: !501, size: 384, offset: 608)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "link_socket_actual", file: !502, line: 85, size: 384, elements: !503)
!502 = !DIFile(filename: "../../../src/openvpn/socket.h", directory: "/home/kevin/Bugs/openvpn-2.4.6/build_opt/src/openvpn")
!503 = !{!504, !557}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !501, file: !502, line: 89, baseType: !505, size: 224)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "openvpn_sockaddr", file: !502, line: 64, size: 224, elements: !506)
!506 = !{!507}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !505, file: !502, line: 71, baseType: !508, size: 224)
!508 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !505, file: !502, line: 67, size: 224, elements: !509)
!509 = !{!510, !522, !537}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !508, file: !502, line: 68, baseType: !511, size: 128)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !512, line: 153, size: 128, elements: !513)
!512 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/kevin/Bugs/openvpn-2.4.6/build_opt/src/openvpn")
!513 = !{!514, !518}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !511, file: !512, line: 155, baseType: !515, size: 16)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !516, line: 28, baseType: !517)
!516 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/kevin/Bugs/openvpn-2.4.6/build_opt/src/openvpn")
!517 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !511, file: !512, line: 156, baseType: !519, size: 112, offset: 16)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 112, elements: !520)
!520 = !{!521}
!521 = !DISubrange(count: 14)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "in4", scope: !508, file: !502, line: 69, baseType: !523, size: 128)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !524, line: 239, size: 128, elements: !525)
!524 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/kevin/Bugs/openvpn-2.4.6/build_opt/src/openvpn")
!525 = !{!526, !527, !530, !535}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !523, file: !524, line: 241, baseType: !515, size: 16)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !523, file: !524, line: 242, baseType: !528, size: 16, offset: 16)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !524, line: 119, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !40, line: 49, baseType: !517)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !523, file: !524, line: 243, baseType: !531, size: 32, offset: 32)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !524, line: 31, size: 32, elements: !532)
!532 = !{!533}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !531, file: !524, line: 33, baseType: !534, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !524, line: 30, baseType: !60)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !523, file: !524, line: 246, baseType: !536, size: 64, offset: 64)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 64, elements: !498)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "in6", scope: !508, file: !502, line: 70, baseType: !538, size: 224)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !524, line: 254, size: 224, elements: !539)
!539 = !{!540, !541, !542, !543, !556}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !538, file: !524, line: 256, baseType: !515, size: 16)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !538, file: !524, line: 257, baseType: !528, size: 16, offset: 16)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !538, file: !524, line: 258, baseType: !60, size: 32, offset: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !538, file: !524, line: 259, baseType: !544, size: 128, offset: 64)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !524, line: 211, size: 128, elements: !545)
!545 = !{!546}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !544, file: !524, line: 220, baseType: !547, size: 128)
!547 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !544, file: !524, line: 213, size: 128, elements: !548)
!548 = !{!549, !550, !552}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !547, file: !524, line: 215, baseType: !38, size: 128)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !547, file: !524, line: 217, baseType: !551, size: 128)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !529, size: 128, elements: !498)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !547, file: !524, line: 218, baseType: !553, size: 128)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 128, elements: !554)
!554 = !{!555}
!555 = !DISubrange(count: 4)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !538, file: !524, line: 260, baseType: !60, size: 32, offset: 192)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "pi", scope: !501, file: !502, line: 98, baseType: !558, size: 160, offset: 224)
!558 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !501, file: !502, line: 91, size: 160, elements: !559)
!559 = !{!560, !567}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "in4", scope: !558, file: !502, line: 93, baseType: !561, size: 96)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_pktinfo", file: !562, line: 148, size: 96, elements: !563)
!562 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/in.h", directory: "/home/kevin/Bugs/openvpn-2.4.6/build_opt/src/openvpn")
!563 = !{!564, !565, !566}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "ipi_ifindex", scope: !561, file: !562, line: 150, baseType: !75, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "ipi_spec_dst", scope: !561, file: !562, line: 151, baseType: !531, size: 32, offset: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ipi_addr", scope: !561, file: !562, line: 152, baseType: !531, size: 32, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "in6", scope: !558, file: !502, line: 97, baseType: !568, size: 160)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_pktinfo", file: !524, line: 537, size: 160, elements: !569)
!569 = !{!570, !571}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ipi6_addr", scope: !568, file: !524, line: 539, baseType: !544, size: 128)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ipi6_ifindex", scope: !568, file: !524, line: 540, baseType: !61, size: 32, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "crypto_options", scope: !471, file: !11, line: 168, baseType: !16, size: 1472, offset: 1024)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "key_src", scope: !471, file: !11, line: 170, baseType: !574, size: 64, offset: 2496)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "key_source2", file: !11, line: 125, size: 1792, elements: !576)
!576 = !{!577, !589}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "client", scope: !575, file: !11, line: 126, baseType: !578, size: 896)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "key_source", file: !11, line: 108, size: 896, elements: !579)
!579 = !{!580, !584, !588}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "pre_master", scope: !578, file: !11, line: 109, baseType: !581, size: 384)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 384, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 48)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "random1", scope: !578, file: !11, line: 112, baseType: !585, size: 256, offset: 384)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 256, elements: !586)
!586 = !{!587}
!587 = !DISubrange(count: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "random2", scope: !578, file: !11, line: 115, baseType: !585, size: 256, offset: 640)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !575, file: !11, line: 127, baseType: !578, size: 896, offset: 896)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "plaintext_read_buf", scope: !471, file: !11, line: 172, baseType: !108, size: 192, offset: 2560)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "plaintext_write_buf", scope: !471, file: !11, line: 173, baseType: !108, size: 192, offset: 2752)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "ack_write_buf", scope: !471, file: !11, line: 174, baseType: !108, size: 192, offset: 2944)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "send_reliable", scope: !471, file: !11, line: 176, baseType: !594, size: 64, offset: 3136)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reliable", file: !596, line: 85, size: 3264, elements: !597)
!596 = !DIFile(filename: "../../../src/openvpn/reliable.h", directory: "/home/kevin/Bugs/openvpn-2.4.6/build_opt/src/openvpn")
!597 = !{!598, !599, !600, !601, !602, !603}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !595, file: !596, line: 87, baseType: !75, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "initial_timeout", scope: !595, file: !596, line: 88, baseType: !190, size: 32, offset: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "packet_id", scope: !595, file: !596, line: 89, baseType: !59, size: 32, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !595, file: !596, line: 90, baseType: !75, size: 32, offset: 96)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "hold", scope: !595, file: !596, line: 91, baseType: !50, size: 8, offset: 128)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !595, file: !596, line: 92, baseType: !604, size: 3072, offset: 192)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !605, size: 3072, elements: !498)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reliable_entry", file: !596, line: 71, size: 384, elements: !606)
!606 = !{!607, !608, !609, !610, !611, !612}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !605, file: !596, line: 73, baseType: !50, size: 8)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !605, file: !596, line: 74, baseType: !190, size: 32, offset: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "next_try", scope: !605, file: !596, line: 75, baseType: !63, size: 64, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "packet_id", scope: !605, file: !596, line: 76, baseType: !59, size: 32, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !605, file: !596, line: 77, baseType: !75, size: 32, offset: 160)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !605, file: !596, line: 78, baseType: !108, size: 192, offset: 192)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "rec_reliable", scope: !471, file: !11, line: 177, baseType: !594, size: 64, offset: 3200)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "rec_ack", scope: !471, file: !11, line: 178, baseType: !615, size: 64, offset: 3264)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reliable_ack", file: !596, line: 61, size: 288, elements: !617)
!617 = !{!618, !619}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !616, file: !596, line: 63, baseType: !75, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "packet_id", scope: !616, file: !596, line: 64, baseType: !620, size: 256, offset: 32)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 256, elements: !498)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "paybuf", scope: !471, file: !11, line: 180, baseType: !622, size: 64, offset: 3328)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buffer_list", file: !109, line: 1077, size: 192, elements: !624)
!624 = !{!625, !631, !632, !633}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !623, file: !109, line: 1079, baseType: !626, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buffer_entry", file: !109, line: 1071, size: 256, elements: !628)
!628 = !{!629, !630}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !627, file: !109, line: 1073, baseType: !108, size: 192)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !627, file: !109, line: 1074, baseType: !626, size: 64, offset: 192)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !623, file: !109, line: 1080, baseType: !626, size: 64, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !623, file: !109, line: 1081, baseType: !75, size: 32, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !623, file: !109, line: 1082, baseType: !75, size: 32, offset: 160)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "n_bytes", scope: !471, file: !11, line: 182, baseType: !635, size: 64, offset: 3392)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "counter_type", file: !191, line: 31, baseType: !636)
!636 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "n_packets", scope: !471, file: !11, line: 183, baseType: !635, size: 64, offset: 3456)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "authenticated", scope: !471, file: !11, line: 188, baseType: !50, size: 8, offset: 3520)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "auth_deferred_expire", scope: !471, file: !11, line: 189, baseType: !63, size: 64, offset: 3584)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "auth_deferred", scope: !471, file: !11, line: 193, baseType: !50, size: 8, offset: 3648)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "mda_key_id", scope: !471, file: !11, line: 195, baseType: !61, size: 32, offset: 3680)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "mda_status", scope: !471, file: !11, line: 196, baseType: !61, size: 32, offset: 3712)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "auth_control_status", scope: !471, file: !11, line: 199, baseType: !61, size: 32, offset: 3744)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "acf_last_mod", scope: !471, file: !11, line: 200, baseType: !63, size: 64, offset: 3776)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "auth_control_file", scope: !471, file: !11, line: 201, baseType: !209, size: 64, offset: 3840)
!646 = !{!647}
!647 = !DISubrange(count: 3)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "save_ks", scope: !141, file: !11, line: 495, baseType: !470, size: 64, offset: 5824)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "to_link_addr", scope: !141, file: !11, line: 501, baseType: !501, size: 384, offset: 5888)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "n_sessions", scope: !141, file: !11, line: 503, baseType: !75, size: 32, offset: 6272)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "n_hard_errors", scope: !141, file: !11, line: 509, baseType: !75, size: 32, offset: 6304)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "n_soft_errors", scope: !141, file: !11, line: 510, baseType: !75, size: 32, offset: 6336)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "locked_cn", scope: !141, file: !11, line: 515, baseType: !209, size: 64, offset: 6400)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "locked_username", scope: !141, file: !11, line: 516, baseType: !209, size: 64, offset: 6464)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "locked_cert_hash_set", scope: !141, file: !11, line: 517, baseType: !656, size: 64, offset: 6528)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cert_hash_set", file: !451, line: 61, size: 1024, elements: !658)
!658 = !{!659}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !657, file: !451, line: 62, baseType: !660, size: 1024)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !661, size: 1024, elements: !42)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cert_hash", file: !451, line: 56, size: 256, elements: !663)
!663 = !{!664}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "sha256_hash", scope: !662, file: !451, line: 57, baseType: !665, size: 256)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 256, elements: !586)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "client_reason", scope: !141, file: !11, line: 523, baseType: !209, size: 64, offset: 6592)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "tas_last", scope: !141, file: !11, line: 526, baseType: !63, size: 64, offset: 6656)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "peer_info", scope: !141, file: !11, line: 534, baseType: !209, size: 64, offset: 6720)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "peer_id", scope: !141, file: !11, line: 538, baseType: !60, size: 32, offset: 6784)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "use_peer_id", scope: !141, file: !11, line: 539, baseType: !50, size: 8, offset: 6816)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ciphername", scope: !141, file: !11, line: 541, baseType: !209, size: 64, offset: 6848)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "auth_token", scope: !141, file: !11, line: 543, baseType: !209, size: 64, offset: 6912)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "auth_token_tstamp", scope: !141, file: !11, line: 547, baseType: !63, size: 64, offset: 6976)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "auth_token_sent", scope: !141, file: !11, line: 548, baseType: !50, size: 8, offset: 7040)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "session", scope: !141, file: !11, line: 553, baseType: !676, size: 31296, offset: 7104)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !677, size: 31296, elements: !646)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tls_session", file: !11, line: 384, size: 10432, elements: !678)
!678 = !{!679, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "opt", scope: !677, file: !11, line: 387, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "burst", scope: !677, file: !11, line: 390, baseType: !50, size: 8, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "tls_wrap", scope: !677, file: !11, line: 393, baseType: !12, size: 1728, offset: 128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "initial_opcode", scope: !677, file: !11, line: 395, baseType: !75, size: 32, offset: 1856)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "session_id", scope: !677, file: !11, line: 396, baseType: !493, size: 64, offset: 1888)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "key_id", scope: !677, file: !11, line: 403, baseType: !75, size: 32, offset: 1952)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "limit_next", scope: !677, file: !11, line: 405, baseType: !75, size: 32, offset: 1984)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "verify_maxlevel", scope: !677, file: !11, line: 407, baseType: !75, size: 32, offset: 2016)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "common_name", scope: !677, file: !11, line: 409, baseType: !209, size: 64, offset: 2048)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "cert_hash_set", scope: !677, file: !11, line: 411, baseType: !656, size: 64, offset: 2112)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "common_name_hashval", scope: !677, file: !11, line: 414, baseType: !60, size: 32, offset: 2176)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "verified", scope: !677, file: !11, line: 417, baseType: !50, size: 8, offset: 2208)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "untrusted_addr", scope: !677, file: !11, line: 420, baseType: !501, size: 384, offset: 2240)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !677, file: !11, line: 422, baseType: !694, size: 7808, offset: 2624)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 7808, elements: !695)
!695 = !{!696}
!696 = !DISubrange(count: 2)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tls_auth_standalone", file: !699, line: 129, size: 1984, elements: !700)
!699 = !DIFile(filename: "../../../src/openvpn/ssl.h", directory: "/home/kevin/Bugs/openvpn-2.4.6/build_opt/src/openvpn")
!700 = !{!701, !702}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "tls_wrap", scope: !698, file: !699, line: 131, baseType: !12, size: 1728)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !698, file: !699, line: 132, baseType: !220, size: 256, offset: 1728)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "packet_id_print_type", file: !53, line: 98, baseType: !61)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !544)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "user_pass", file: !241, line: 172, size: 2080, elements: !710)
!710 = !{!711, !712, !713, !714, !715, !719}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "defined", scope: !709, file: !241, line: 174, baseType: !50, size: 8)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "nocache", scope: !709, file: !241, line: 175, baseType: !50, size: 8, offset: 8)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "tokenized", scope: !709, file: !241, line: 176, baseType: !50, size: 8, offset: 16)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "wait_for_push", scope: !709, file: !241, line: 177, baseType: !50, size: 8, offset: 24)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !709, file: !241, line: 185, baseType: !716, size: 1024, offset: 32)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 1024, elements: !717)
!717 = !{!718}
!718 = !DISubrange(count: 128)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !709, file: !241, line: 186, baseType: !716, size: 1024, offset: 1056)
!720 = !{!721, !723, !725, !727, !0}
!721 = !DIGlobalVariableExpression(var: !722)
!722 = distinct !DIGlobalVariable(name: "passbuf", scope: !2, file: !3, line: 371, type: !709, isLocal: true, isDefinition: true)
!723 = !DIGlobalVariableExpression(var: !724)
!724 = distinct !DIGlobalVariable(name: "auth_user_pass_enabled", scope: !2, file: !3, line: 401, type: !50, isLocal: true, isDefinition: true)
!725 = !DIGlobalVariableExpression(var: !726)
!726 = distinct !DIGlobalVariable(name: "auth_user_pass", scope: !2, file: !3, line: 402, type: !709, isLocal: true, isDefinition: true)
!727 = !DIGlobalVariableExpression(var: !728)
!728 = distinct !DIGlobalVariable(name: "auth_challenge", scope: !2, file: !3, line: 405, type: !209, isLocal: true, isDefinition: true)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 18816, elements: !737)
!730 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !731)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "tls_cipher_name_pair", file: !732, line: 62, baseType: !733)
!732 = !DIFile(filename: "../../../src/openvpn/ssl_backend.h", directory: "/home/kevin/Bugs/openvpn-2.4.6/build_opt/src/openvpn")
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !732, line: 62, size: 128, elements: !734)
!734 = !{!735, !736}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "openssl_name", scope: !733, file: !732, line: 62, baseType: !92, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "iana_name", scope: !733, file: !732, line: 62, baseType: !92, size: 64, offset: 64)
!737 = !{!738}
!738 = !DISubrange(count: 147)
!739 = !{i32 2, !"Dwarf Version", i32 4}
!740 = !{i32 2, !"Debug Info Version", i32 3}
!741 = !{i32 1, !"wchar_size", i32 4}
!742 = !{!"clang version 5.0.0 (tags/RELEASE_500/final)"}
!743 = distinct !DISubprogram(name: "tls_get_cipher_name_pair", scope: !3, file: !3, line: 271, type: !744, isLocal: false, isDefinition: true, scopeLine: 272, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !747)
!744 = !DISubroutineType(types: !745)
!745 = !{!746, !92, !45}
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!747 = !{!748, !749, !750}
!748 = !DILocalVariable(name: "cipher_name", arg: 1, scope: !743, file: !3, line: 271, type: !92)
!749 = !DILocalVariable(name: "len", arg: 2, scope: !743, file: !3, line: 271, type: !45)
!750 = !DILocalVariable(name: "pair", scope: !743, file: !3, line: 273, type: !746)
!751 = !DIExpression()
!752 = !DILocation(line: 271, column: 38, scope: !743)
!753 = !DILocation(line: 271, column: 58, scope: !743)
!754 = !DILocation(line: 273, column: 33, scope: !743)
!755 = !DILocation(line: 275, column: 5, scope: !743)
!756 = !DILocation(line: 277, column: 14, scope: !757)
!757 = distinct !DILexicalBlock(scope: !758, file: !3, line: 277, column: 13)
!758 = distinct !DILexicalBlock(scope: !743, file: !3, line: 276, column: 5)
!759 = !DILocation(line: 277, column: 41, scope: !757)
!760 = !DILocation(line: 277, column: 48, scope: !757)
!761 = !DILocation(line: 277, column: 56, scope: !757)
!762 = !DILocation(line: 277, column: 53, scope: !757)
!763 = !DILocation(line: 278, column: 13, scope: !757)
!764 = !DILocation(line: 278, column: 30, scope: !757)
!765 = !{!766, !767, i64 8}
!766 = !{!"", !767, i64 0, !767, i64 8}
!767 = !{!"any pointer", !768, i64 0}
!768 = !{!"omnipotent char", !769, i64 0}
!769 = !{!"Simple C/C++ TBAA"}
!770 = !DILocation(line: 278, column: 17, scope: !757)
!771 = !DILocation(line: 278, column: 41, scope: !757)
!772 = !DILocation(line: 278, column: 48, scope: !757)
!773 = !DILocation(line: 278, column: 56, scope: !757)
!774 = !DILocation(line: 278, column: 53, scope: !757)
!775 = !DILocation(line: 277, column: 13, scope: !758)
!776 = !DILocation(line: 282, column: 13, scope: !758)
!777 = !DILocation(line: 275, column: 18, scope: !743)
!778 = !{!766, !767, i64 0}
!779 = !DILocation(line: 275, column: 31, scope: !743)
!780 = distinct !{!780, !755, !781}
!781 = !DILocation(line: 283, column: 5, scope: !743)
!782 = !DILocation(line: 287, column: 1, scope: !743)
!783 = distinct !DISubprogram(name: "tls_adjust_frame_parameters", scope: !3, file: !3, line: 317, type: !784, isLocal: false, isDefinition: true, scopeLine: 318, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !787)
!784 = !DISubroutineType(types: !785)
!785 = !{null, !786}
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!787 = !{!788}
!788 = !DILocalVariable(name: "frame", arg: 1, scope: !783, file: !3, line: 317, type: !786)
!789 = !DILocation(line: 317, column: 43, scope: !783)
!790 = !DILocalVariable(name: "frame", arg: 1, scope: !791, file: !221, line: 274, type: !786)
!791 = distinct !DISubprogram(name: "frame_add_to_extra_frame", scope: !221, file: !221, line: 274, type: !792, isLocal: true, isDefinition: true, scopeLine: 275, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !794)
!792 = !DISubroutineType(types: !793)
!793 = !{null, !786, !318}
!794 = !{!790, !795}
!795 = !DILocalVariable(name: "increment", arg: 2, scope: !791, file: !221, line: 274, type: !318)
!796 = !DILocation(line: 274, column: 40, scope: !791, inlinedAt: !797)
!797 = distinct !DILocation(line: 319, column: 5, scope: !783)
!798 = !DILocation(line: 274, column: 57, scope: !791, inlinedAt: !797)
!799 = !DILocation(line: 276, column: 12, scope: !791, inlinedAt: !797)
!800 = !DILocation(line: 276, column: 24, scope: !791, inlinedAt: !797)
!801 = !{!802, !803, i64 8}
!802 = !{!"frame", !803, i64 0, !803, i64 4, !803, i64 8, !803, i64 12, !803, i64 16, !803, i64 20, !803, i64 24, !803, i64 28}
!803 = !{!"int", !768, i64 0}
!804 = !DILocation(line: 320, column: 1, scope: !783)
!805 = distinct !DISubprogram(name: "init_ssl_lib", scope: !3, file: !3, line: 350, type: !806, isLocal: false, isDefinition: true, scopeLine: 351, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !808)
!806 = !DISubroutineType(types: !807)
!807 = !{null}
!808 = !{}
!809 = !DILocation(line: 352, column: 5, scope: !805)
!810 = !DILocation(line: 354, column: 5, scope: !805)
!811 = !DILocation(line: 355, column: 1, scope: !805)
!812 = distinct !DISubprogram(name: "free_ssl_lib", scope: !3, file: !3, line: 358, type: !806, isLocal: false, isDefinition: true, scopeLine: 359, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !808)
!813 = !DILocation(line: 360, column: 5, scope: !812)
!814 = !DILocation(line: 361, column: 5, scope: !812)
!815 = !DILocation(line: 363, column: 5, scope: !812)
!816 = !DILocation(line: 364, column: 1, scope: !812)
!817 = distinct !DISubprogram(name: "pem_password_setup", scope: !3, file: !3, line: 374, type: !818, isLocal: false, isDefinition: true, scopeLine: 375, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !820)
!818 = !DISubroutineType(types: !819)
!819 = !{null, !92}
!820 = !{!821}
!821 = !DILocalVariable(name: "auth_file", arg: 1, scope: !817, file: !3, line: 374, type: !92)
!822 = !DILocation(line: 374, column: 32, scope: !817)
!823 = !DILocation(line: 376, column: 10, scope: !824)
!824 = distinct !DILexicalBlock(scope: !817, file: !3, line: 376, column: 9)
!825 = !DILocation(line: 376, column: 9, scope: !817)
!826 = !DILocation(line: 249, column: 12, scope: !827, inlinedAt: !835)
!827 = distinct !DISubprogram(name: "get_user_pass", scope: !241, file: !241, line: 244, type: !828, isLocal: true, isDefinition: true, scopeLine: 248, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !830)
!828 = !DISubroutineType(types: !829)
!829 = !{!50, !708, !92, !92, !359}
!830 = !{!831, !832, !833, !834}
!831 = !DILocalVariable(name: "up", arg: 1, scope: !827, file: !241, line: 244, type: !708)
!832 = !DILocalVariable(name: "auth_file", arg: 2, scope: !827, file: !241, line: 245, type: !92)
!833 = !DILocalVariable(name: "prefix", arg: 3, scope: !827, file: !241, line: 246, type: !92)
!834 = !DILocalVariable(name: "flags", arg: 4, scope: !827, file: !241, line: 247, type: !359)
!835 = distinct !DILocation(line: 378, column: 9, scope: !836)
!836 = distinct !DILexicalBlock(scope: !824, file: !3, line: 377, column: 5)
!837 = !DILocation(line: 379, column: 5, scope: !836)
!838 = !DILocation(line: 380, column: 1, scope: !817)
!839 = distinct !DISubprogram(name: "pem_password_callback", scope: !3, file: !3, line: 383, type: !840, isLocal: false, isDefinition: true, scopeLine: 384, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !842)
!840 = !DISubroutineType(types: !841)
!841 = !{!75, !209, !75, !75, !135}
!842 = !{!843, !844, !845, !846}
!843 = !DILocalVariable(name: "buf", arg: 1, scope: !839, file: !3, line: 383, type: !209)
!844 = !DILocalVariable(name: "size", arg: 2, scope: !839, file: !3, line: 383, type: !75)
!845 = !DILocalVariable(name: "rwflag", arg: 3, scope: !839, file: !3, line: 383, type: !75)
!846 = !DILocalVariable(name: "u", arg: 4, scope: !839, file: !3, line: 383, type: !135)
!847 = !DILocation(line: 383, column: 29, scope: !839)
!848 = !DILocation(line: 383, column: 38, scope: !839)
!849 = !DILocation(line: 383, column: 48, scope: !839)
!850 = !DILocation(line: 383, column: 62, scope: !839)
!851 = !DILocation(line: 385, column: 9, scope: !852)
!852 = distinct !DILexicalBlock(scope: !839, file: !3, line: 385, column: 9)
!853 = !DILocation(line: 385, column: 9, scope: !839)
!854 = !DILocation(line: 374, column: 32, scope: !817, inlinedAt: !855)
!855 = distinct !DILocation(line: 388, column: 9, scope: !856)
!856 = distinct !DILexicalBlock(scope: !852, file: !3, line: 386, column: 5)
!857 = !DILocation(line: 376, column: 10, scope: !824, inlinedAt: !855)
!858 = !DILocation(line: 376, column: 9, scope: !817, inlinedAt: !855)
!859 = !DILocation(line: 249, column: 12, scope: !827, inlinedAt: !860)
!860 = distinct !DILocation(line: 378, column: 9, scope: !836, inlinedAt: !855)
!861 = !DILocation(line: 379, column: 5, scope: !836, inlinedAt: !855)
!862 = !DILocation(line: 389, column: 42, scope: !856)
!863 = !DILocation(line: 345, column: 5, scope: !864, inlinedAt: !871)
!864 = distinct !DISubprogram(name: "strncpynt", scope: !109, file: !109, line: 343, type: !865, isLocal: true, isDefinition: true, scopeLine: 344, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !867)
!865 = !DISubroutineType(types: !866)
!866 = !{null, !209, !92, !45}
!867 = !{!868, !869, !870}
!868 = !DILocalVariable(name: "dest", arg: 1, scope: !864, file: !109, line: 343, type: !209)
!869 = !DILocalVariable(name: "src", arg: 2, scope: !864, file: !109, line: 343, type: !92)
!870 = !DILocalVariable(name: "maxlen", arg: 3, scope: !864, file: !109, line: 343, type: !45)
!871 = distinct !DILocation(line: 389, column: 9, scope: !856)
!872 = !DILocation(line: 346, column: 16, scope: !873, inlinedAt: !871)
!873 = distinct !DILexicalBlock(scope: !864, file: !109, line: 346, column: 9)
!874 = !DILocation(line: 346, column: 9, scope: !864, inlinedAt: !871)
!875 = !DILocation(line: 348, column: 21, scope: !876, inlinedAt: !871)
!876 = distinct !DILexicalBlock(scope: !873, file: !109, line: 347, column: 5)
!877 = !DILocation(line: 348, column: 9, scope: !876, inlinedAt: !871)
!878 = !DILocation(line: 348, column: 26, scope: !876, inlinedAt: !871)
!879 = !{!768, !768, i64 0}
!880 = !DILocation(line: 349, column: 5, scope: !876, inlinedAt: !871)
!881 = !DILocation(line: 390, column: 9, scope: !856)
!882 = !DILocation(line: 392, column: 16, scope: !856)
!883 = !DILocation(line: 392, column: 9, scope: !856)
!884 = !DILocation(line: 395, column: 1, scope: !839)
!885 = distinct !DISubprogram(name: "auth_user_pass_setup", scope: !3, file: !3, line: 409, type: !886, isLocal: false, isDefinition: true, scopeLine: 410, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !888)
!886 = !DISubroutineType(types: !887)
!887 = !{null, !92, !458}
!888 = !{!889, !890, !891}
!889 = !DILocalVariable(name: "auth_file", arg: 1, scope: !885, file: !3, line: 409, type: !92)
!890 = !DILocalVariable(name: "sci", arg: 2, scope: !885, file: !3, line: 409, type: !458)
!891 = !DILocalVariable(name: "flags", scope: !892, file: !3, line: 428, type: !75)
!892 = distinct !DILexicalBlock(scope: !893, file: !3, line: 427, column: 9)
!893 = distinct !DILexicalBlock(scope: !894, file: !3, line: 426, column: 18)
!894 = distinct !DILexicalBlock(scope: !895, file: !3, line: 418, column: 13)
!895 = distinct !DILexicalBlock(scope: !896, file: !3, line: 413, column: 5)
!896 = distinct !DILexicalBlock(scope: !885, file: !3, line: 412, column: 9)
!897 = !DILocation(line: 409, column: 34, scope: !885)
!898 = !DILocation(line: 409, column: 81, scope: !885)
!899 = !DILocation(line: 412, column: 25, scope: !896)
!900 = !{!901, !902, i64 0}
!901 = !{!"user_pass", !902, i64 0, !902, i64 1, !902, i64 2, !902, i64 3, !768, i64 4, !768, i64 132}
!902 = !{!"_Bool", !768, i64 0}
!903 = !{i8 0, i8 2}
!904 = !DILocation(line: 412, column: 9, scope: !885)
!905 = !DILocation(line: 418, column: 13, scope: !894)
!906 = !{!767, !767, i64 0}
!907 = !DILocation(line: 418, column: 13, scope: !895)
!908 = !DILocation(line: 420, column: 13, scope: !909)
!909 = distinct !DILexicalBlock(scope: !894, file: !3, line: 419, column: 9)
!910 = !DILocation(line: 425, column: 9, scope: !909)
!911 = !DILocation(line: 426, column: 18, scope: !893)
!912 = !DILocation(line: 426, column: 18, scope: !894)
!913 = !DILocation(line: 428, column: 17, scope: !892)
!914 = !DILocation(line: 429, column: 22, scope: !915)
!915 = distinct !DILexicalBlock(scope: !892, file: !3, line: 429, column: 17)
!916 = !{!917, !803, i64 0}
!917 = !{!"static_challenge_info", !803, i64 0, !767, i64 8}
!918 = !DILocation(line: 429, column: 17, scope: !892)
!919 = !DILocation(line: 437, column: 35, scope: !892)
!920 = !{!917, !767, i64 8}
!921 = !DILocation(line: 433, column: 13, scope: !892)
!922 = !DILocation(line: 438, column: 9, scope: !892)
!923 = !DILocation(line: 249, column: 12, scope: !827, inlinedAt: !924)
!924 = distinct !DILocation(line: 441, column: 9, scope: !893)
!925 = !DILocation(line: 444, column: 1, scope: !885)
!926 = distinct !DISubprogram(name: "ssl_set_auth_nocache", scope: !3, file: !3, line: 450, type: !806, isLocal: false, isDefinition: true, scopeLine: 451, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !808)
!927 = !DILocation(line: 452, column: 21, scope: !926)
!928 = !{!901, !902, i64 1}
!929 = !DILocation(line: 453, column: 28, scope: !926)
!930 = !DILocation(line: 455, column: 34, scope: !926)
!931 = !{!901, !902, i64 3}
!932 = !DILocation(line: 456, column: 1, scope: !926)
!933 = distinct !DISubprogram(name: "ssl_set_auth_token", scope: !3, file: !3, line: 462, type: !818, isLocal: false, isDefinition: true, scopeLine: 463, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !934)
!934 = !{!935}
!935 = !DILocalVariable(name: "token", arg: 1, scope: !933, file: !3, line: 462, type: !92)
!936 = !DILocation(line: 462, column: 32, scope: !933)
!937 = !DILocation(line: 464, column: 24, scope: !938)
!938 = distinct !DILexicalBlock(scope: !933, file: !3, line: 464, column: 9)
!939 = !DILocation(line: 464, column: 9, scope: !933)
!940 = !DILocalVariable(name: "flags", arg: 1, scope: !941, file: !942, line: 252, type: !61)
!941 = distinct !DISubprogram(name: "msg_test", scope: !942, file: !942, line: 252, type: !943, isLocal: true, isDefinition: true, scopeLine: 253, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !945)
!942 = !DIFile(filename: "../../../src/openvpn/error.h", directory: "/home/kevin/Bugs/openvpn-2.4.6/build_opt/src/openvpn")
!943 = !DISubroutineType(types: !944)
!944 = !{!50, !61}
!945 = !{!940}
!946 = !DILocation(line: 252, column: 23, scope: !941, inlinedAt: !947)
!947 = distinct !DILocation(line: 466, column: 9, scope: !948)
!948 = distinct !DILexicalBlock(scope: !949, file: !3, line: 466, column: 9)
!949 = distinct !DILexicalBlock(scope: !950, file: !3, line: 466, column: 9)
!950 = distinct !DILexicalBlock(scope: !938, file: !3, line: 465, column: 5)
!951 = !DILocalVariable(name: "level", arg: 1, scope: !952, file: !942, line: 245, type: !61)
!952 = distinct !DISubprogram(name: "check_debug_level", scope: !942, file: !942, line: 245, type: !943, isLocal: true, isDefinition: true, scopeLine: 246, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !953)
!953 = !{!951}
!954 = !DILocation(line: 245, column: 32, scope: !952, inlinedAt: !955)
!955 = distinct !DILocation(line: 254, column: 12, scope: !941, inlinedAt: !947)
!956 = !DILocation(line: 247, column: 39, scope: !952, inlinedAt: !955)
!957 = !{!803, !803, i64 0}
!958 = !DILocation(line: 247, column: 36, scope: !952, inlinedAt: !955)
!959 = !DILocation(line: 254, column: 37, scope: !941, inlinedAt: !947)
!960 = !DILocation(line: 254, column: 40, scope: !941, inlinedAt: !947)
!961 = !DILocation(line: 466, column: 9, scope: !949)
!962 = !DILocation(line: 466, column: 9, scope: !963)
!963 = distinct !DILexicalBlock(scope: !948, file: !3, line: 466, column: 9)
!964 = !DILocation(line: 469, column: 32, scope: !950)
!965 = !DILocation(line: 470, column: 5, scope: !950)
!966 = !DILocation(line: 472, column: 5, scope: !933)
!967 = !DILocation(line: 473, column: 1, scope: !933)
!968 = distinct !DISubprogram(name: "ssl_purge_auth", scope: !3, file: !3, line: 479, type: !969, isLocal: false, isDefinition: true, scopeLine: 480, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !972)
!969 = !DISubroutineType(types: !970)
!970 = !{null, !971}
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!972 = !{!973}
!973 = !DILocalVariable(name: "auth_user_pass_only", arg: 1, scope: !968, file: !3, line: 479, type: !971)
!974 = !DILocation(line: 479, column: 27, scope: !968)
!975 = !DILocation(line: 481, column: 9, scope: !968)
!976 = !DILocation(line: 486, column: 9, scope: !977)
!977 = distinct !DILexicalBlock(scope: !978, file: !3, line: 482, column: 5)
!978 = distinct !DILexicalBlock(scope: !968, file: !3, line: 481, column: 9)
!979 = !DILocation(line: 487, column: 5, scope: !977)
!980 = !DILocation(line: 488, column: 5, scope: !968)
!981 = !DILocation(line: 499, column: 10, scope: !982, inlinedAt: !983)
!982 = distinct !DISubprogram(name: "ssl_purge_auth_challenge", scope: !3, file: !3, line: 497, type: !806, isLocal: false, isDefinition: true, scopeLine: 498, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !808)
!983 = distinct !DILocation(line: 490, column: 5, scope: !968)
!984 = !DILocation(line: 499, column: 5, scope: !982, inlinedAt: !983)
!985 = !DILocation(line: 500, column: 20, scope: !982, inlinedAt: !983)
!986 = !DILocation(line: 492, column: 1, scope: !968)
!987 = !DILocation(line: 499, column: 10, scope: !982)
!988 = !DILocation(line: 499, column: 5, scope: !982)
!989 = !DILocation(line: 500, column: 20, scope: !982)
!990 = !DILocation(line: 501, column: 1, scope: !982)
!991 = distinct !DISubprogram(name: "ssl_put_auth_challenge", scope: !3, file: !3, line: 504, type: !818, isLocal: false, isDefinition: true, scopeLine: 505, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !992)
!992 = !{!993}
!993 = !DILocalVariable(name: "cr_str", arg: 1, scope: !991, file: !3, line: 504, type: !92)
!994 = !DILocation(line: 504, column: 36, scope: !991)
!995 = !DILocation(line: 499, column: 10, scope: !982, inlinedAt: !996)
!996 = distinct !DILocation(line: 506, column: 5, scope: !991)
!997 = !DILocation(line: 499, column: 5, scope: !982, inlinedAt: !996)
!998 = !DILocation(line: 500, column: 20, scope: !982, inlinedAt: !996)
!999 = !DILocation(line: 507, column: 22, scope: !991)
!1000 = !DILocation(line: 507, column: 20, scope: !991)
!1001 = !DILocation(line: 508, column: 1, scope: !991)
!1002 = distinct !DISubprogram(name: "tls_version_parse", scope: !3, file: !3, line: 518, type: !1003, isLocal: false, isDefinition: true, scopeLine: 519, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1005)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!75, !92, !92}
!1005 = !{!1006, !1007, !1008, !1009, !1012, !1013, !1015, !1016, !1019, !1020, !1022, !1023, !1026, !1027, !1029, !1030, !1033, !1034, !1036, !1037, !1040, !1041, !1043}
!1006 = !DILocalVariable(name: "vstr", arg: 1, scope: !1002, file: !3, line: 518, type: !92)
!1007 = !DILocalVariable(name: "extra", arg: 2, scope: !1002, file: !3, line: 518, type: !92)
!1008 = !DILocalVariable(name: "max_version", scope: !1002, file: !3, line: 520, type: !318)
!1009 = !DILocalVariable(name: "__s1_len", scope: !1010, file: !3, line: 521, type: !45)
!1010 = distinct !DILexicalBlock(scope: !1011, file: !3, line: 521, column: 10)
!1011 = distinct !DILexicalBlock(scope: !1002, file: !3, line: 521, column: 9)
!1012 = !DILocalVariable(name: "__s2_len", scope: !1010, file: !3, line: 521, type: !45)
!1013 = !DILocalVariable(name: "__s2", scope: !1014, file: !3, line: 521, type: !138)
!1014 = distinct !DILexicalBlock(scope: !1010, file: !3, line: 521, column: 10)
!1015 = !DILocalVariable(name: "__result", scope: !1014, file: !3, line: 521, type: !75)
!1016 = !DILocalVariable(name: "__s1_len", scope: !1017, file: !3, line: 525, type: !45)
!1017 = distinct !DILexicalBlock(scope: !1018, file: !3, line: 525, column: 15)
!1018 = distinct !DILexicalBlock(scope: !1011, file: !3, line: 525, column: 14)
!1019 = !DILocalVariable(name: "__s2_len", scope: !1017, file: !3, line: 525, type: !45)
!1020 = !DILocalVariable(name: "__s2", scope: !1021, file: !3, line: 525, type: !138)
!1021 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 525, column: 15)
!1022 = !DILocalVariable(name: "__result", scope: !1021, file: !3, line: 525, type: !75)
!1023 = !DILocalVariable(name: "__s1_len", scope: !1024, file: !3, line: 529, type: !45)
!1024 = distinct !DILexicalBlock(scope: !1025, file: !3, line: 529, column: 15)
!1025 = distinct !DILexicalBlock(scope: !1018, file: !3, line: 529, column: 14)
!1026 = !DILocalVariable(name: "__s2_len", scope: !1024, file: !3, line: 529, type: !45)
!1027 = !DILocalVariable(name: "__s2", scope: !1028, file: !3, line: 529, type: !138)
!1028 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 529, column: 15)
!1029 = !DILocalVariable(name: "__result", scope: !1028, file: !3, line: 529, type: !75)
!1030 = !DILocalVariable(name: "__s1_len", scope: !1031, file: !3, line: 533, type: !45)
!1031 = distinct !DILexicalBlock(scope: !1032, file: !3, line: 533, column: 15)
!1032 = distinct !DILexicalBlock(scope: !1025, file: !3, line: 533, column: 14)
!1033 = !DILocalVariable(name: "__s2_len", scope: !1031, file: !3, line: 533, type: !45)
!1034 = !DILocalVariable(name: "__s2", scope: !1035, file: !3, line: 533, type: !138)
!1035 = distinct !DILexicalBlock(scope: !1031, file: !3, line: 533, column: 15)
!1036 = !DILocalVariable(name: "__result", scope: !1035, file: !3, line: 533, type: !75)
!1037 = !DILocalVariable(name: "__s1_len", scope: !1038, file: !3, line: 537, type: !45)
!1038 = distinct !DILexicalBlock(scope: !1039, file: !3, line: 537, column: 24)
!1039 = distinct !DILexicalBlock(scope: !1032, file: !3, line: 537, column: 14)
!1040 = !DILocalVariable(name: "__s2_len", scope: !1038, file: !3, line: 537, type: !45)
!1041 = !DILocalVariable(name: "__s2", scope: !1042, file: !3, line: 537, type: !138)
!1042 = distinct !DILexicalBlock(scope: !1038, file: !3, line: 537, column: 24)
!1043 = !DILocalVariable(name: "__result", scope: !1042, file: !3, line: 537, type: !75)
